export default function Home() {
  return (
    <main className="flex min-h-screen flex-col items-center justify-between px-5 py-12 sm:p-24">
      <div className="z-10 w-full leading-loose tracking-widest">
        <p>
          紹介<br/>
          notan は書き綴る事と、対話をすること、その双方を行き来しながら、あなたの考えがまとまるように手助けする道具です。
          一般的なフォルダを廃止したミニマルなノート機能と、手が止まった時に、あなたの話を傾聴し、親身な質問などを介しサポートする会話の壁打ち機能が主なビルディング・ブロックです。
          もう一つ、notan の特徴として NLUI 中心の操作があります。私たちは、自然言語による操作こそが CLI → GUI と遷移してきたユーザー・インターフェイスの次の形だと確信しています。
          <br/><br/>
          問題<br/>
          他の人と言葉を交わすことによって、私たちは思考が整理されたり、感情に整理がついたり、アイデアを思いついたりします。
          しかし交易的で忙しない資本主義の世界では、あなたの話に真剣に耳を傾けてくれる人々は貴重です。
          もしいま思い浮かぶ人が居るのなら、あなたは大変恵まれているという事を忘れないで下さい。そして、ぜひ彼らを大切にしてください。
          そんな愛されている人でさえ、優しさから彼らの都合を考えると、つい自分話をするのを躊躇してしまうことがあるのではないでしょうか。
          セラピストという職業が存在し、多くの人が彼らにお金を払ってまで自分の話を傾聴してもらうほどに、
          真摯に相手の話に耳を傾け、聴いてもらえていると感じさせるのは練習を要する難しい事です。
          <br/><br/>
          解決策<br/>
          notan が目指すのは友人や家族、あるいはパートナーの存在を代替することではありません。
          あなたが行き詰まって胸がつっかえるような孤独で苦しい時に、胸の内にあるものを気にすることなく吐き出せる相手、そしてあなたの背中を優しく前へ押してくれる、そんなお供的な存在を目指して notan を開発しています。
          <br/><br/>
          セレンディピティ<br/>
          この言葉は、偶然の発見という意味で、セレンディップの三人の王子たちというペルシアのおとぎ話に由来します。王の命令により旅にでた三人の王子が、途中でであう難問をつぎつぎと解決し、ついには思いがけない幸運を手に入れるという物語です。
          このツールを通してセレンディピティを最大化することを目指しています。フォルダ機能を故意的に実装しなかったのも、カテゴライズする魅力を理解している故であり、ついページを綺麗にフォルダリングすることに没頭し時間を浪費してしまうことを防ぐ為です。
          とある事柄に関連するページを一括で見たい場合は、「〇〇についてのページを見せて」と入力することで、フォルダと同様の機能を実現できます。
          散在していた点、すなわち考え、を結びつけることに注力していることをここではご理解いただければ幸いです。
          <br/><br/>
          紙について<br/>
          最先端のテクノロジーをこよなく愛する一方で、私たちは紙にペンを走らせる事が大好き、かつ、これからますます重要になると考えています。
          紙に書く事は、禅的集中状態に入る補助としては最適です。創造すること、深く考えを巡らし良き判断を下すことは今後よりいっそう人類に求められる価値の要です。
          その第一歩として、notan は機械学習スキャニングサービスを提供します。ノートなどアナログとデジタルの差別なく、場合によって使い分けても無縫に一箇所に集約し、デジタル文書と同様にすぐにアクセスできます。
          また、万が一、あなたの大切なノートが紛失した場合でも、バックアップとなり安心です。
          <br/><br/>
          最後に<br/>
          notan はまだ赤子のような存在です。
          私たちが notan という道具を革新的なものまで磨き上げ、文字通り世界中の人々の生活をより心地よく滞りなく流れるように、
          共に夢中で道具作りに励みたい方がおりましたら、ご連絡ください。
          <br/><br/>
          takuzen0430 [at] gmail.com
        </p>
      </div>
    </main>
  )
}