export default function Home() {
  return (
    <main className="flex min-h-screen flex-col items-center justify-between px-5 py-12 sm:p-24">
      <div className="z-10 w-full tracking-widest">
        <p>
          当時デートしていた女性との電話でしばらく彼女の話に耳を傾けていると、何度か驚くほど感謝された。
          正直この行為は、Men Are from Mars, Women Are from Venusかなんかの恋愛本に書いてあったモテる為の努力であったが、
          新しい物事を知ることが生来好きな性格だからか、傾聴は割と得意で、好きでさえあったから、よく実践していた。
          <br/><br/>
          自分は、一方で、あまり話を聞いて欲しい事に対しては強い欲求を持っていないが、友達と雑談していると、頭の中のぐちゃぐちゃしていた考えが整理されていくのを感じることがある。
          友人の口から出た予想外の言葉によってアイデアが生まれることや、仲間の賛否が自分の考えに自信を持ったり、はたまた本当にそれはいい考えか？と再考を促されることも度々あり、
          だからこそコーヒーブレイクは自分にとっては大好きで貴重な時間である。メモ魔である自分は友達と分かれると、忘れないうちにすぐに振り返って響いた事柄のメモを取るのが常であった。
          <br/><br/>
          そんな中、ChatGPTに触れ、そうして notan が生まれた。
          <br/><br/>
          - アハ体験への最適化
          <br/><br/>
          - フォルダの廃止
          <br/><br/>
          - ノートは取るものから、生成されるものへ
          <br/><br/>
          To be continued...
        </p>
      </div>
    </main>
  )
}
